#Необходимо создать целочисленные переменные a и b,
# присвоить произвольные значения переменным на ваш выбор
# и вывести результаты следующих операций с этими переменными: сложение, умножение, вычитание, деление и остаток от деления.
# Также сделать проверку на четность этих переменных и вывести результат.

# a=5
# b=13
# c=a+b
# print(c)
# print("Число c четное?:", c%2 ==0)
# print("Число c нечетное?:", c%2 ==1)
# print(type(c))
# print(a-b)
# print(a*b)
# print(a/b)
# print(a//b)
# print(a%b)
# print(type(a))
# print(type(b))



# a,b=10,3
# a,b=b,a
# print(a,b)


#Создать программу дележа добычи на пиратском корабле. По обычаю, половина
# добычи идет владельцу корабля, половина оставшегося — капитану, остальное делится поровну между всеми
# членами команды, включая капитана.


# Размер добычи (например, в дублонах) и количество пиратов на корабле задать переменными.
#
# Вывести на экран кому сколько дублонов полагается
# Сколько получит капитан (Джек Воробей, естественно), если он утверждает, что корабль принадлежит ему?

# Исходные данные
loot = 100      # Общий размер добычи в дублонах
count = 5   # Общее количество пиратов (включая капитана)

# Добыча владельца коробля
owner= loot / 2
print('Добыча владельца коробля', owner)

# Сколько осталось добычи, после того как владелец забрал себе половину
remaning_ower= loot - owner
print('Сколько осталось добычи, после того как владелец забрал себе половину', remaning_ower)

# Сколько капитану
captan= remaning_ower/2
print('Сколько капитану', captan)

# Сколько осталось
remaning_captan = remaning_ower-captan
print('Сколько осталось', remaning_captan)

#Делим порувну на всех
all=remaning_captan/count

print('kazdij chel komady',all)

dzek=owner+captan+all
print('капитану', dzek)
