#
# #Найти периметр треугольника
# # a=float(input("Введите сторону a: "))
# # b=float(input("Введите сторону b: "))
# # c=float(input("Введите сторону c: "))
# #
# # p=a+b+c
# # print(p)
#
#
# #
# # a = int(input())
# # b = int(input())
# # print(a * b)
# #
# # a = float(input())
# # b = float(input())
# # print(a * b)
#
# # Особенности ввода данных в функции input()
# # ➖ она не может считывать несколько строк, поскольку нажатие клавиши
# # «Enter» обозначает конец ввода. А без «Enter» невозможно перенести текст на новую строку;
# #
# # ➖ всё, что введено в пределах одной строки, будет сохранено функцией input. Любой символ, включая пробелы, будет учтён.
# #____________________________________________________________________________________
# print('Ввод нескольких числовых значений в одной строке')
# # Если вводятся три целых числа в одну строку, то результат нашей новой
# # инструкции необходимо сохранить в три переменных, пример показан ниже
#
# a, b, c = map(int, input().split())
# print(a, type(a))
# print(b, type(b))
# print(c, type(c))
# print(a + b + c)
#
# # 1 2 3
# # 1 <class 'int'>
# # 2 <class 'int'>
# # 3 <class 'int'>
# # 6
# #____________________________________________________________________________________
# print('считывание вещественных числа, которые записаны в одной строке')
#
# a, b, c = map(float, input().split())
# print(a, type(a))
# print(b, type(b))
# print(c, type(c))
# print(a + b + c)
#
# #____________________________________________________________________________________
# print('считывание слов, которые записаны в одной строке')
# a, b, c = input().split()
# print(a, b, c)
#
# # Если
# # необходимо
# # считать
# # значение
# # в
# # виде
# # строки, используйте
# # следующий
# # вариант:
# # переменная = int(input())
# #
# # ✅   Если
# # необходимо
# # считать
# # значение
# # в
# # виде
# # целого
# # числа, используйте
# # следующий
# # вариант:
# #
# # переменная = int(input())
# #
# #
# # ✅   Если
# # необходимо
# # считать
# # значение
# # в
# # виде
# # вещественного
# # числа, используйте
# # следующий
# # вариант:
# #
# # переменная = float(input())
# #
# #
# # ✅  Если
# # необходимо
# # считать
# # несколько
# # целых
# # чисел, вводимых
# # через
# # пробел
# # в
# # одной
# # строке, используйте
# # следующий
# # вариант:
# #
# # переменная_1, переменная_2, ..., переменная_N = map(int, input().split())
# #
# #
# # ✅  Если
# # необходимо
# # считать
# # несколько
# # вещественных
# # чисел, вводимых
# # через
# # пробел
# # в
# # одной
# # строке, используйте
# # следующий
# # вариант:
# #
# # переменная_1, переменная_2, ..., переменная_N = map(float, input().split())
# #
# #
# # ✅  Если
# # необходимо
# # считать
# # значения
# # в
# # виде
# # строк
# # и
# # каждое
# # слово
# # сохранить
# # в
# # отдельную
# # переменную, используйте
# # следующий
# # вариант:
# #
# # переменная_1, переменная_2, ..., переменная_N = input().split()

#разложение чисел на цифры
# a=int(input('Введи четырех значное число, а я выведу тебе разложенное'))
# 1234
# b=a//1000
# c=(a//100)%10
# d=(a//10)%10
# e=a%10
# print(b,c,d,e)

# total_seconds = int(input("Введите количество секунд: "))
#
# days = total_seconds // 86400
# remaining_hours = (total_seconds % 86400) // 3600
#
# print("Полных дней:", days)
# print("Полных часов в остатке:", remaining_hours)
# print('Если делимое меньше делителя, то результат остатка всегда равен делимому')
# print(14 % 28)

