# #Условные конструкции в Python
# # Операторы сравнения и тип bool
# # Изучите следующие операторы:
# # == — равно;
# # != — не равно;
# # > — больше;
# # < — меньше;
# # >= — больше или равно;
# # <= — меньше или равно.
#
# # age = 16
# # is_adult = age >= 18
# #
# # print(is_adult)
# # print(type(is_adult))
#
# # Условная конструкция ifУсловная конструкция if (если)
# # позволяет программе принимать решения и выполнять определенный
# # код только тогда, когда выполняется какое-то условие
# # (когда оно истинно, то есть равно True).Если условие верно,
# # Python выполняет команды внутри специального блока. Если условие ложно (False), этот блок просто пропускается.
#
# # Пример 1: Условие истинно
# # score = 85
# # if score > 50:
# #     print("Экзамен сдан!")  # Этот код выполнится
# #
# #  # Пример 2: Условие ложно
# #     money = 50
# #     item_price = 100
# #     if money >= item_price:
# #         print("Покупка совершена.")  # Этот код не выполнится, ничего не напечатается
# #
# # # На этом этапе используйте в условии сравнения и логические выражения, результатом которых является True или False.
# # # temperature = 18
# # temperature=1
# # if temperature > 0:
# #     print("Температура выше нуля")
# #     print("Можно идти на прогулку")
# # Обе команды с одинаковым отступом относятся к блоку if. Если условие ложно, этот блок не выполняется.
# # В Python фигурные скобки не обозначают блок программы. Структура определяется отступами. Обычно используется четыре пробела на каждый уровень вложенности.
#
# # Альтернативная ветка else
#
# # Ветка else позволяет выполнить другой блок, если условие после if оказалось ложным.
# # Важно: у else не пишется никакое условие. Он срабатывает автоматически во всех случаях, когда условие в if вернуло False.
# # age = 19
# #
# # if age >= 18:
# #     print("Доступ разрешён")
# # else:
# #     print("Доступ запрещён")
# # Обратите внимание:
# # после else также ставится двоеточие;
# # if и связанный с ним else находятся на одном уровне отступа;
# # из двух блоков выполняется только один.
#
# # Тема 5: Логические операторы not, and и or
#
# # Иногда одного сравнения мало. Например, «если на улице тепло и нет дождя».
# # Для объединения нескольких условий или изменения их смысла в Python есть три логических оператора
# # :not (НЕ) — разворачивает результат.Если условие было True, оператор not превратит его в False, и наоборот.
# # Он как бы говорит: «сделай наоборот».and
# # (И) — требует выполнения ВСЕХ условий.Результат будет True только в том случае, если и левое, и правое условия одновременно равны True.
# # Если хотя бы одно условие ложно, то и весь результат False.
# # or (ИЛИ) — требует выполнения ХОТЯ БЫ ОДНОГО условия.Результат будет True, если верно левое условие, ИЛИ правое условие, ИЛИ оба сразу.
# # Он станет False только тогда, когда все условия вокруг него ложны.
#
# # Пример 1: Оператор not
# is_weekend = False
# print(not is_weekend)  # Выведет: True (не выходной = будний день)
#
# # Пример 2: Оператор and
# age = 20
# has_ticket = True
#
# # Нужно, чтобы совпали оба условия
# if age >= 18 and has_ticket:
#     print("Вход разрешен")  # Выполнится, так как оба условия True
#
#  # Пример 3: Оператор or
#     has_cash = False
#     has_card = True
#
#     # Достаточно хотя бы одного способа оплаты
#     if has_cash or has_card:
#         print("Можно совершить покупку")  # Выполнится, так как card — True
#
# # 5. Приоритет выполнения операций
# # Для выражений из этого занятия используйте следующий порядок:
# # выражения в круглых скобках;!!!!
# # арифметические операции;
# # операторы сравнения (>, <, ==, != и т.д.) — выполняются после математики;
# # логический оператор not;имеет наивысший приоритет среди логических
# # логический оператор and;— выполняется после not
# # логический оператор or.— выполняется в самую последнюю очередь
#
# age = 20
# has_ticket = True
# is_blocked = False
#
# can_enter = age >= 18 and has_ticket and not is_blocked
# print('can_enter>>', can_enter)
# # Сначала выполняются сравнения и not, затем части выражения объединяются с помощью and. Используйте круглые скобки,
# # если они делают условие понятнее.
#
# # Пример 2: Разница приоритетов and и or
# # Без скобок сначала выполнится 'and': True and False -> False.
# # Затем выполнится 'or': False or False -> False.
# print('Разница приоритетов and и or--', False or True and False)  # Выведет: False
#
# # Со скобками сначала выполнится 'or': False or True -> True.
# # Затем выполнится 'and': True and False -> False.
# print('Разница приоритетов and и or--', (False or True) and False)  # Выведет: False
#
# # Тема 7: Цепочки сравнений
# # В математике мы часто пишем двойные неравенства, например: 10 < x < 20.
# # Во многих языках программирования так писать нельзя, но Python поддерживает цепочки сравнений напрямую
# # !Как читается такая цепочка? Python проверяет её слева направо, как если бы они были соединены оператором and.
# # То есть выражение 10 < x < 20 для Python означает то же самое, что и 10 < x and x < 20.
# # Это делает код гораздо более чистым и легко читаемым для человека.
#
# # Пример 1: Проверка, входит ли число в диапазон
# age = 25
# # Читается как: "Возраст от 18 до 30 лет включительно"
# if 18 <= age <= 30:
#     print("Возраст подходит для участия в молодежной программе.")
#
# # Пример 2: Можно использовать любые операторы сравнения в цепочке
# x = 5
# print(1 < x == 5)  # Выведет: True (так как 1 < 5 И 5 == 5)
#
# # Тема 8: Вложенные условные конструкции
#
# # Иногда решение зависит от нескольких шагов. Сначала мы проверяем одно условие,
# # а если оно верно, проверяем внутри него другое. Такой подход называется вложенными условными конструкциями (или «if внутри if»).
#
# # Пример 1: Базовый вложенный if
# age = 18
# has_passport = True
#
# if age >= 18:
#     print("Возраст подходит.")
#     if has_passport:
#         print("Паспорт есть. Можно оформлять документы!")  # Выполнится этот текст
# else: print("Оформлять документы! НЕЛЬЗЯ")
#
# # Пример 2: Вложенность с участием else
# is_logged_in = False
# is_admin = True
#
# if is_logged_in:
#     print("Вход выполнен.")
#     if is_admin:
#         print("Добро пожаловать, администратор!")
#     else:
#         print("Добро пожаловать, пользователь!")  # Выполнится этот текст

# 8. Debugging
# age = 17
# has_permission = True
#
# print(age >= 18) # False
# print(has_permission)  # True
# print(age >= 18 and has_permission)# False

# Задание 1 (Сравнения)
# speed = 65
# is_speeding = speed > 60  # Здесь запишется True
#
# print(is_speeding)        # Выведет: True
# print(type(is_speeding))  # Выведет: <class 'bool'>



# Задание 2 (Конструкция if-else):
# temperature = 19
#
# if temperature < 18:
#     print("Включить обогреватель")
# else:
#     print("Обогреватель выключен")

# Задание 3 (Логические операторы):
# Напиши условие, которое выведет "Можно идти гулять", если дождя нет ИЛИ если дождь идет, но у тебя есть зонт.

# has_umbrella = True #(есть зонт)
# is_raining = True #(идет дождь)
#
# if not is_raining  or is_raining and has_umbrella:
#     print("Можно идти гулять")

# Задание 4 (Цепочки сравнений):
# Переменная month = 7 (июль).
# Напиши с помощью цепочки сравнений условие,
# которое проверяет, лежит ли номер месяца в диапазоне
# от 6 до 8 включительно (летние месяцы). Если да, выведи "Это лето!".

# month = 7
#
# if 6 <= month <= 8:
#     print("Это лето!")

# Задание 5 (Вложенные условия):

# Напиши код для автомата с напитками.
# Есть переменные has_money = True и choice = "coffee".
# Сначала проверь, есть ли деньги. Если есть, выведи "Автомат готов к работе",
# а затем внутри проверь: если выбор равен "coffee", выведи "Наливаем кофе", иначе выведи "Выбран другой напиток".

# has_money = True
# choice = "coffee"
#
# if has_money:
#     print("Автомат готов к работе")
#
#     if choice == "coffee":
#         print("Наливаем кофе")
#     else:
#         print("Выбран другой напиток")
#

# weight = 25 #(вес чемодана в килограммах)
# has_vip_status = True #(есть ли у пассажира VIP-билет)
#
# if weight <= 20:
#     print('Багаж принят без доплаты')
#
# else:
#     if has_vip_status:
#         print("Перевес, но для VIP-клиентов это бесплатно")
#     else:
#         print("Требуется доплата за перевес!")

# is_low_balance = True
# is_huge_spending = False
# notifications_enabled = True
#
# if (notifications_enabled==True) and (is_low_balance==True or is_huge_spending ==True):
#     print("Отправляем СМС-уведомление")
#
# if notifications_enabled and (is_low_balance or is_huge_spending):
#     print("Отправляем СМС-уведомление")

# Задание 3: Вход в игру (Цепочки сравнений)

# player_level = 15
#
# if 11<=player_level<=49:
#     print("Добро пожаловать на сервер!")
# else:
#     print("Ваш уровень не подходит для этого сервера")

# Необходимо создать две целочисленные переменные (a, b),
# присвоить произвольные значения переменным на ваш выбор и вывести следующие строки:
# a == b - если переменные равны
# a < b - если переменная a меньше b
# a > b - если переменная b меньше a

# print('Введите число a:')
# a=int(input())
#
# print('Введите число b')
# b= int(input())
#
#
# if a==b:
#     print('Переменные равны')
# else:
#
#     if a < b:
#         print('переменная a меньше b')
#     else:
#         print('переменная b больше a')

# Необходимо создать две целочисленные переменные (a, b),
# присвоить произвольные значения переменным на ваш выбор и вывести следующие строки:
# maybe a and b are even - если сумма переменных четная
# some variable is odd - если сумма переменных нечетная

# print('Введите число a:')
# a=int(input())
# print('Введите число b')
# b= int(input())
#
# c=a+b
# if c%2 ==0:
#     print('maybe a and b are even')
# else:
#     print('some variable is odd')

# Необходимо создать целочисленную переменную, присвоить произвольное значение переменной на ваш выбор и вывести следующие строки:
# больше 10 - если переменная больше 10
# меньше 100 - если переменная меньше 100
# результат деления на 2 больше 20 - если это соответствует истине
# значение переменной между 5 и 40 включительно - если это правда
# значение переменной меньше 5 или больше 40 - если предыдущие условие ложное
#
# a=int(input())
#
# if a>10:
#     print('больше 10')
# if a<100:
#     print('меньше 100')
#
# if a/2>20:
#     print('результат деления на 2 больше 20')
#
# if 5<=a<=40:
#     print('значение переменной между 5 и 40 включительно')
# else:
#     print('значение переменной меньше 5 или больше 40')

n=int(input())

if n%2==0:
    print(n+2)
else:
    print(n+1)
